In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/027.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

         0    1    2                     3                    4
0      NaN  NaN  NaN  Gingrey (R)  118,524  Pillion (D)  48,261
1      NaN  NaN  NaN                 71.1%                28.9%
2   County   PR   TP                   NaN                  NaN
3   BARTOW   19   19                 13830                 5035
4  CARROLL   17   17                  6493                 3057

In [5]:
df = df[3:]

In [6]:
df.head(5)

           0   1   2      3      4
3     BARTOW  19  19  13830   5035
4    CARROLL  17  17   6493   3057
5  CHATTOOGA  15  15   2967   2117
6       COBB  89  89  48210  19652
7      FLOYD  27  27  14278   5758

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

           0      3      4
3     BARTOW  13830   5035
4    CARROLL   6493   3057
5  CHATTOOGA   2967   2117
6       COBB  48210  19652
7      FLOYD  14278   5758

In [9]:
df.columns = ['county', 'Phil Gingrey', 'Patrick Samuel Pillion']

In [10]:
df.tail(5)

      county Phil Gingrey Patrick Samuel Pillion
7      FLOYD        14278                   5758
8     GORDON         3757                   1690
9   HARALSON         4378                   1631
10  PAULDING        19185                   6728
11      POLK         5426                   2593

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

      county     candidate  votes
0     BARTOW  Phil Gingrey  13830
1    CARROLL  Phil Gingrey   6493
2  CHATTOOGA  Phil Gingrey   2967
3       COBB  Phil Gingrey  48210
4      FLOYD  Phil Gingrey  14278

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 3 columns):
county       18 non-null object
candidate    18 non-null object
votes        18 non-null int64
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '11'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Phil Gingrey', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Patrick Samuel Pillion', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate               party
Patrick Samuel Pillion  Democrat       48261
Phil Gingrey            Republican    118524
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

      county               office district       party     candidate  votes
0     BARTOW  U.S. Representative       11  Republican  Phil Gingrey  13830
1    CARROLL  U.S. Representative       11  Republican  Phil Gingrey   6493
2  CHATTOOGA  U.S. Representative       11  Republican  Phil Gingrey   2967
3       COBB  U.S. Representative       11  Republican  Phil Gingrey  48210
4      FLOYD  U.S. Representative       11  Republican  Phil Gingrey  14278

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')